rwcii/afterglow/test/target/sdkconfig.defaults
# Target-test defaults — mirror the firmware's radio/PSRAM options so the test
# app (which links radio_single -> esp_bt.h) configures the same way as the
# main build. Kept in sync with the top-level sdkconfig.defaults.

CONFIG_IDF_TARGET="esp32s3"

# PSRAM — the pool slab allocates from SPIRAM via heap_caps_malloc.
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=n

# Wi-Fi + BLE coexistence.
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
CONFIG_ESP_WIFI_ENABLED=y

# Bluetooth: Bluedroid with BLE 4.2 legacy advertising (radio_single uses the
# legacy esp_ble_gap_* APIs and includes esp_bt.h).
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=n

# Flash (8 MB) + a large single-app partition: the test app links BT + Wi-Fi +
# Unity and exceeds the default 1 MB factory partition.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
